{"_id":{"$oid":"5909920644623517306e3c55"},"updatedAt":{"$date":"2017-05-03T08:17:10.806Z"},"createdAt":{"$date":"2017-05-03T08:17:10.806Z"},"title":"Exercice 1","content":"identifiant : fab@fab.com\nmot de passe : fab\n\n1. Ce qu’est un fork Github ?\nUn fork c'est une copie d'un projet complet qui a été créer par une équipe de développeur et qui ce retrouve sur notre compte github.\n\n2. A quoi sert-il ?\nCela sert a travailler sur ce projet sans modifier le projet existant, et aussi a soumettre des améliorations éventuelles au projet. Ces améliorations seront envoyer a l'équipe de développeurs qui les analyseront et les intégreront au projet si cela est pertinent.\n\n3. Qu’est-ce qu’une pull request ? Quel est l’intérêt ?\nUn pull request consiste à demander à l'auteur original de merge nos modifications.\nL’intérêt c’est de ne pas polluer le projet avec des fonctionnalités inutile et une vérification du code par l’auteur original.\n\n4. Qu’est-ce qu’une branche ?\nUne branche c’est comme route paralléle au projet pour pouvoir développer des fonctionnalité sans risquer de modifier le projet fonctionnel.\n\n\n5. Quelle est la différence entre une branche et un fork ? \nUn fork est constituer de plusieurs branches dans lesquelles les développeurs développent leurs fonctionnalités.","__v":0}
{"_id":{"$oid":"59099d6097f8a31db6f634b2"},"updatedAt":{"$date":"2017-05-03T09:05:36.630Z"},"createdAt":{"$date":"2017-05-03T09:05:36.630Z"},"title":"La MEAN stack","content":"Angular\nCôté front – Facultatif - Elle sert a produire des page WEB dynamique pour des site one- Page. Un site one-page est un site qui n’a qu’une seule page principal et que angular implémente avec des morceaux de code HTML.\n\nAngular UI Router\nCôté front – Facultatif – Cela sert a appeler les morceaux de page a introduire dans la one-Page suivant l’interaction de l’utilisateur.\n\nExpress\n Côté back – Facultatif – Framework pour NodeJS. Fournit des outils pour créationd’application Node.\u0009\n\nJSONWebToken\nCôté back \u0026 front – Facultatif si on ne veut pas de sécurité – Pour sécuriser une API REST\n\nMongoose\nCôté back – Facultatif – Pour simplifier les appelles a la base de données\n\n\nMaterializeCSS\nCôté front – Facultatif – C’est un frameworkpour mettre du design dans les pages WEB.\n\nPassport\nCôté back \u0026 front – Facultatif si on ne veut pas de sécurité – C’est pour l’authentification.\n\nBabel\nCôté front – Facultatif – Sert a utiliser ES6. Converti en ES5 pour les navigateurs qui ne fonctionnne pas avec ES6.\n\nSCSS\nCôté front – Facultatif – Nouveau format, c’est comme du CSS en mieux\n\n\nNodemon\nCôté back –\n\nWebpack\nCôté back – \n\nLivereload\nCôté back –","__v":0}
